zephyrproject-rtos/hal_nxp/mcux/drivers/kinetis/fsl_hsadc.h
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_HSADC_H_
#define _FSL_HSADC_H_

#include "fsl_common.h"

/*!
 * @addtogroup hsadc
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*! @brief HSADC driver version. */
#define FSL_HSADC_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*! @brief Converter index to mask for sample slot. */
#define HSADC_SAMPLE_MASK(index) (1U << (index))

/*!
 * @brief HSADC status flags.
 */
enum _hsadc_status_flags
{
    kHSADC_ZeroCrossingFlag               = (1U << 0U),  /*!< Zero crossing. */
    kHSADC_HighLimitFlag                  = (1U << 1U),  /*!< High-limit. */
    kHSADC_LowLimitFlag                   = (1U << 2U),  /*!< Low-limit. */
    kHSADC_ConverterAEndOfScanFlag        = (1U << 3U),  /*!< End of Scan, converter A. */
    kHSADC_ConverterBEndOfScanFlag        = (1U << 4U),  /*!< End of Scan, converter B. */
    kHSADC_ConverterAEndOfCalibrationFlag = (1U << 5U),  /*!< End of Calibration, converter A. */
    kHSADC_ConverterBEndOfCalibrationFlag = (1U << 6U),  /*!< End of Calibration, converter B. */
    kHSADC_ConverterAConvertingFlag       = (1U << 7U),  /*!< Conversion in progress, converter A. */
    kHSADC_ConverterBConvertingFlag       = (1U << 8U),  /*!< Conversion in progress, converter B. */
    kHSADC_ConverterADummyConvertingFlag  = (1U << 9U),  /*!< Dummy conversion in progress, converter A. */
    kHSADC_ConverterBDummyConvertingFlag  = (1U << 10U), /*!< Dummy conversion in progress, converter B. */
    kHSADC_ConverterACalibratingFlag      = (1U << 11U), /*!< Calibration in progress, converter A. */
    kHSADC_ConverterBCalibratingFlag      = (1U << 12U), /*!< Calibration in progress, converter B. */
    kHSADC_ConverterAPowerDownFlag        = (1U << 13U), /*!< The converter is powered down, converter A. */
    kHSADC_ConverterBPowerDownFlag        = (1U << 14U), /*!< The converter is powered down, converter B. */
};

/*!
 * @brief HSADC Interrupts.
 */
enum _hsadc_interrupt_enable
{
    kHSADC_ZeroCrossingInterruptEnable               = (1U << 0U), /*!< Zero crossing interrupt. */
    kHSADC_HighLimitInterruptEnable                  = (1U << 1U), /*!< High-limit interrupt. */
    kHSADC_LowLimitInterruptEnable                   = (1U << 2U), /*!< Low-limit interrupt. */
    kHSADC_ConverterAEndOfScanInterruptEnable        = (1U << 3U), /*!< End of Scan interrupt, converter A. */
    kHSADC_ConverterBEndOfScanInterruptEnable        = (1U << 4U), /*!< End of Scan interrupt, converter B.*/
    kHSADC_ConverterAEndOfCalibrationInterruptEnable = (1U << 5U), /*!< End of Calibration, converter A. */
    kHSADC_ConverterBEndOfCalibrationInterruptEnable = (1U << 6U), /*!< End of Calibration, converter B. */
};

/*!
 * @brief HSADC Converter identifier.
 */
enum _hsadc_converter_id
{
    kHSADC_ConverterA = (1U << 0U), /*!< Converter A. */
    kHSADC_ConverterB = (1U << 1U), /*!< Converter B. */
};

/*!
 * @brief Defines the enumeration for dual converter scan mode.
 */
typedef enum _hsadc_dual_converter_scan_mode
{
    kHSADC_DualConverterWorkAsOnceSequential      = 0U, /*!< Once (single) sequential. */
    kHSADC_DualConverterWorkAsOnceParallel        = 1U, /*!< Once parallel. */
    kHSADC_DualConverterWorkAsLoopSequential      = 2U, /*!< Loop sequential. */
    kHSADC_DualConverterWorkAsLoopParallel        = 3U, /*!< Loop parallel. */
    kHSADC_DualConverterWorkAsTriggeredSequential = 4U, /*!< Triggered sequential. */
    kHSADC_DualConverterWorkAsTriggeredParallel   = 5U, /*!< Triggered parallel. */
} hsadc_dual_converter_scan_mode_t;

typedef enum _hsadc_resolution
{
    kHSADC_Resolution6Bit  = 0U, /*!< 6 bit resolution mode. */
    kHSADC_Resolution8Bit  = 1U, /*!< 8 bit resolution mode. */
    kHSADC_Resolution10Bit = 2U, /*!< 10 bit resolution mode. */
    kHSADC_Resolution12Bit = 3U, /*!< 12 bit resolution mode. */
} hsadc_resolution_t;

/*!
 * @brief Defines the enumeration for the DMA trigger source.
 */
typedef enum _hsadc_dma_trigger_source
{
    kHSADC_DMATriggerSourceAsEndOfScan   = 0U, /*!< DMA trigger source is end of scan interrupt. */
    kHSADC_DMATriggerSourceAsSampleReady = 1U, /*!< DMA trigger source is RDY bits. */
} hsadc_dma_trigger_source_t;

/*!
 * @brief Defines the enumeration for the sample slot's zero crossing event.
 */
typedef enum _hsadc_zero_crossing_mode
{
    kHSADC_ZeroCorssingDisabled          = 0U, /*!< Zero Crossing disabled. */
    kHSADC_ZeroCorssingForPtoNSign       = 1U, /*!< Zero Crossing enabled for positive to negative sign change. */
    kHSADC_ZeroCorssingForNtoPSign       = 2U, /*!< Zero Crossing enabled for negative to positive sign change. */
    kHSADC_ZeroCorssingForAnySignChanged = 3U, /*!< Zero Crossing enabled for any sign change. */
} hsadc_zero_crossing_mode_t;

/*!
 * @brief Defines the enumeration for the converter's work mode in idle mode.
 */
typedef enum _hsadc_idle_work_mode
{
    kHSADC_IdleKeepNormal    = 0U, /*!< Keep normal. */
    kHSADC_IdleAutoStandby   = 1U, /*!< Fall into standby mode automatically. */
    kHSADC_IdleAutoPowerDown = 2U, /*!< Fall into power down mode automatically. */
} hsadc_idle_work_mode_t;

/*!
 * @brief Converter's calibration mode.
 */
enum _hsadc_calibration_mode
{
    kHSADC_CalibrationModeDifferential = (1U << 0U), /*!< Calibration request for differential mode. */
    kHSADC_CalibrationModeSingleEnded  = (1U << 1U), /*!< Calibration request for single ended mode. */
};

/*! @brief Bit mask of calibration value for converter A in single ended mode. */
#define HSADC_CALIBRATION_VALUE_A_SINGLE_ENDED_MASK HSADC_CALVAL_A_CALVSING_MASK
/*! @brief Bit shift of calibration value for converter A in single ended mode. */
#define HSADC_CALIBRATION_VALUE_A_SINGLE_ENDED_SHIFT HSADC_CALVAL_A_CALVSING_SHIFT
/*! @brief Bit mask of calibration value for converter A in differential mode. */
#define HSADC_CALIBRATION_VALUE_A_DIFFERENTIAL_MASK HSADC_CALVAL_A_CALVDIF_MASK
/*! @brief Bit shift of calibration value for converter A in differential mode. */
#define HSADC_CALIBRATION_VALUE_A_DIFFERENTIAL_SHIFT HSADC_CALVAL_A_CALVDIF_SHIFT
/*! @brief Bit mask of calibration value for converter B in single ended mode. */
#define HSADC_CALIBRATION_VALUE_B_SINGLE_ENDED_MASK (HSADC_CALVAL_B_CALVSING_MASK << 16U)
/*! @brief Bit shift of calibration value for converter B in single ended mode. */
#define HSADC_CALIBRATION_VALUE_B_SINGLE_ENDED_SHIFT (HSADC_CALVAL_B_CALVSING_SHIFT + 16U)
/*! @brief Bit mask of calibration value for converter B in differential mode. */
#define HSADC_CALIBRATION_VALUE_B_DIFFERENTIAL_MASK (HSADC_CALVAL_B_CALVDIF_MASK << 16U)
/*! @brief Bit shift of calibration value for converter B in differential mode. */
#define HSADC_CALIBRATION_VALUE_B_DIFFERENTIAL_SHIFT (HSADC_CALVAL_B_CALVDIF_SHIFT + 16U)

/*!
 * @brief Defines the structure for configuring the HSADC's common setting.
 */
typedef struct _hsadc_config
{
    hsadc_dual_converter_scan_mode_t dualConverterScanMode; /*!< Dual converter's scan mode. */
    bool enableSimultaneousMode;                            /*!< Using Simultaneous mode. */
    hsadc_resolution_t resolution;                          /*!< Resolution mode. */
    hsadc_dma_trigger_source_t DMATriggerSoruce;            /*!< DMA trigger source. */
    hsadc_idle_work_mode_t idleWorkMode;                    /*!< Converter's work mode when idle. */
    uint16_t powerUpDelayCount; /*!< Delay count united as 32 clocks to wait for the clock to be stable. Available
                                range is 0-63. */
} hsadc_config_t;

/*!
 * @brief Defines the structure for configuring each converter.
 */
typedef struct _hsadc_converter_config
{
    uint16_t clockDivisor;      /*!< Converter's clock divisor for the clock source. Available range is 2-64. */
    uint16_t samplingTimeCount; /*!< Sampling time count. The resultant sampling time is (1.5 + samplingTimeCount) x
                                clock period. Available range is 0-255. */
    uint16_t powerUpCalibrationModeMask; /*!< Calibration mode mask in the power up period. See the
                                     "_hsadc_calibration_mode". If this field isn't zero, call the function
                                     HSADC_GetStatusFlags() to check whether the End of Calibration flag is set to wait
                                     for sthe calibration process to complete. If this is zero, it indicates no
                                     calibration is executed in power up period. */
} hsadc_converter_config_t;

/*!
 * @brief Defines the structure for configuring the sample slot.
 *
 * channelNumber, channel67MuxNumber, and enableDifferentialPair have following relationship:
 * channelNumber equals 0~7 represents channel 0~7 of converter A. channelNumber equals 8~15 represents channel 0~7 of
 * converter B.
 * 1) When channelNumber = 6 and enableDifferentialPair = false, channel67MuxNumber represents converter A's channel
 *    6's sub multiplex channel number.
 * 2) When channelNumber = 6 and enableDifferentialPair = true, channel67MuxNumber represents converter A's channel
 *    6 and channel 7's sub multiplex channel number.
 * 3) When channelNumber = 7 and enableDifferentialPair = false, channel67MuxNumber represents converter A's channel
 *    7's sub multiplex channel number.
 * 4) When channelNumber = 7 and enableDifferentialPair = true, channel67MuxNumber represents converter A's channel
 *    6 and channel 7's sub multiplex channel number.
 * 5) When channelNumber = 14 and enableDifferentialPair = false, channel67MuxNumber represents converter B's channel
 *    6's sub multiplex channel number.
 * 6) When channelNumber = 14 and enableDifferentialPair = true, channel67MuxNumber represents converter B's channel
 *    6 and channel 7's sub multiplex channel number.
 * 7) When channelNumber = 15 and enableDifferentialPair = false, channel67MuxNumber represents converter B's channel
 *    7's sub multiplex channel number.
 * 8) When channelNumber = 15 and enableDifferentialPair = true, channel67MuxNumber represents converter B's channel
 *    6 and channel 7's sub multiplex channel number.
 * 9) In other cases, channel67MuxNumber won't be functional.
 */
typedef struct _hsadc_sample_config
{
    /* Conversion channel setting. */
    uint16_t channelNumber;      /*!< Channel number. Available range is 0-15.  */
    uint16_t channel67MuxNumber; /*!< Channel 6/7's sub multiplex channel number. When channelNumber = 6 or 14, its
                                 available range is 0~6. When channelNumber = 7 or 15, its available range is 0~5. */
    bool enableDifferentialPair; /*!< Use differential sample input or not. In differential mode, the sub multiplex
                                 channel number of channel 6 and channel 7 must be configured to be same. */

