zephyrproject-rtos/hal_nxp/mcux/drivers/kinetis/fsl_hsadc.h
    /* sample result setting. */
    hsadc_zero_crossing_mode_t zeroCrossingMode; /*!< Zero crossing mode. */
    uint16_t highLimitValue; /*!< High-limit value. Original value format as hardware register, with 3-bits left
                             shifted. */
    uint16_t lowLimitValue;  /*!< Low-limit value. Original value format as hardware register, with 3-bits left
                             shifted. */
    uint16_t offsetValue;    /*!< Offset value. Original value format as hardware register, with 3-bits left shifted. */
    bool enableWaitSync;     /*!< Wait for sync input to launch this sample's conversion or not. */
} hsadc_sample_config_t;

/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name HSADC Initialization and deinitialization.
 * @{
 */

/*!
 * @brief Initializes the HSADC module.
 *
 * This function initializes the HSADC module.
 * The operations are:
 *  - Enable the clock for HSADC.
 *  - Set the global settings for HSADC converter.
 *
 * @param base   HSADC peripheral base address.
 * @param config Pointer to configuration structure. See the "hsadc_config_t".
 */
void HSADC_Init(HSADC_Type *base, const hsadc_config_t *config);

/*!
 * @brief Gets an available pre-defined settings for module's configuration.
 *
 * This function initializes the module's configuration structure with an available settings.
 * The default value are:
 * @code
 *   config->dualConverterScanMode = kHSADC_DualConverterWorkAsTriggeredParallel;
 *   config->enableSimultaneousMode = true;
 *   config->resolution = kHSADC_Resolution12Bit;
 *   config->DMATriggerSoruce = kHSADC_DMATriggerSourceAsEndOfScan;
 *   config->idleWorkMode = kHSADC_IdleKeepNormal;
 *   config->powerUpDelay = 18U;
 * @endcode
 * @param config Pointer to configuration structure. See the "hsadc_config_t"
 */
void HSADC_GetDefaultConfig(hsadc_config_t *config);

/*!
 * @brief De-initializes the HSADC module.
 *
 * This function de-initializes the HSADC module.
 * The operations are:
 *  - Power down both converters.
 *  - Disable the clock for HSADC.
 *
 * @param base HSADC peripheral base address.
 */
void HSADC_Deinit(HSADC_Type *base);

/* @} */

/*!
 * @name Converter.
 * @{
 */

/*!
 * @brief Configures the converter.
 *
 * @param base          HSADC peripheral base address.
 * @param converterMask Mask for converters to be configured. See the "_hsadc_converter_id".
 * @param config        Pointer to configuration structure. See the "hsadc_converter_config_t".
 */
void HSADC_SetConverterConfig(HSADC_Type *base, uint16_t converterMask, const hsadc_converter_config_t *config);

/*!
 * @brief Gets an available pre-defined settings for each converter's configuration.
 *
 * This function initializes each converter's configuration structure with available settings.
 * The default value are:
 * @code
 *   config->clockDivisor = 4U;
 *   config->samplingTimeCount = 0U;
 *   config->enablePowerUpCalibration = false;
 *   config->powerUpCalibrationModeMask = kHSADC_CalibrationModeSingleEnded;
 * @endcode
 * @param config Pointer to configuration structure. See the "hsadc_converter_config_t"
 */
void HSADC_GetDefaultConverterConfig(hsadc_converter_config_t *config);

/*!
 * @brief Enables the converter's conversion.
 *
 * This function enables the converter's conversion by making the converter exit stop mode. The conversion should
 * only be launched after the converter is enabled. When this feature is asserted to be "false", the current scan is
 * stopped and no further scans can start. All the software and hardware triggers are ignored.
 *
 * @param base          HSADC peripheral base address.
 * @param converterMask Mask for converters to be operated. See the "_hsadc_converter_id".
 * @param enable         Enable or disable the feature.
 */
void HSADC_EnableConverter(HSADC_Type *base, uint16_t converterMask, bool enable);

/*!
 * @brief Enables the input of an external sync signal.
 *
 * This function enables the input of the external sync signal. The external sync signal could be used to trigger the
 * conversion if the hardware trigger-related setting is used.
 * Note: When in "Once" scan mode, this gate is off automatically after an available sync is received.
 * Enable the input again manually if another sync signal is needed.
 *
 * @param base          HSADC peripheral base address.
 * @param converterMask Mask for converters to be operated. See the "_hsadc_converter_id".
 * @param enable        Enable or disable the feature.
 */
void HSADC_EnableConverterSyncInput(HSADC_Type *base, uint16_t converterMask, bool enable);

/*!
 * @brief Enables power for the converter.
 *
 * This function enables the power for the converter. The converter should be powered on before conversion. Once
 * this API is called, the converter is powered on after a few moments (so-called power up delay) to make the
 * power stable.
 *
 * @param base          HSADC peripheral base address.
 * @param converterMask Mask for converters to be operated. See the "_hsadc_converter_id".
 * @param enable        Enable or disable the feature.
 */
void HSADC_EnableConverterPower(HSADC_Type *base, uint16_t converterMask, bool enable);

/*!
 * @brief Triggers the converter by using the software trigger.
 *
 * This function triggers  the converter using a software trigger. The software trigger can be used to start a
 * conversion sequence.
 *
 * @param base          HSADC peripheral base address.
 * @param converterMask Mask for converters to be operated. See the "_hsadc_converter_id".
 */
void HSADC_DoSoftwareTriggerConverter(HSADC_Type *base, uint16_t converterMask);

/*!
 * @brief Enables the DMA feature.
 *
 * @param base          HSADC peripheral base address.
 * @param converterMask Mask for converters to be operated. See the "_hsadc_converter_id".
 * @param enable        Enable or disable the feature.
 */
void HSADC_EnableConverterDMA(HSADC_Type *base, uint16_t converterMask, bool enable);

/*!
 * @brief Enables the interrupts.
 *
 * @param base HSADC peripheral base address.
 * @param mask Mask value for interrupt events. See the "_hsadc_interrupt_enable".
 */
void HSADC_EnableInterrupts(HSADC_Type *base, uint16_t mask);

/*!
 * @brief Disables the interrupts.
 *
 * @param base HSADC peripheral base address.
 * @param mask Mask value for interrupt events. See the "_hsadc_interrupt_enable".
 */
void HSADC_DisableInterrupts(HSADC_Type *base, uint16_t mask);

/*!
 * @brief  Gets the status flags.
 *
 * @param  base HSADC peripheral base address.
 *
 * @return      Mask value for the event flags. See the "_hsadc_status_flags".
 */
uint16_t HSADC_GetStatusFlags(HSADC_Type *base);

/*!
 * @brief Clears the status flags.
 *
 * @param base  HSADC peripheral base address.
 * @param flags Mask value for the event flags to be cleared. See the "_hsadc_status_flags".
 */
void HSADC_ClearStatusFlags(HSADC_Type *base, uint16_t mask);

/* @} */

/*!
 * @name Sample.
 * @{
 */

/*!
 * @brief Configures the sample slot.
 *
 * A sample list in this module works like a conversion sequence. Each sample slot can be used to designate to sample
 * which channel is in converter A and converter B. The detail mapping relationship between sample slot and converter's
 * channel can be found in the SoC reference manual.
 *
 * @param base        HSADC peripheral base address.
 * @param sampleIndex Index of sample slot in conversion sequence. Available range is 0-15.
 * @param config      Pointer to configuration structure. See the "hsadc_sample_config_t".
 */
void HSADC_SetSampleConfig(HSADC_Type *base, uint16_t sampleIndex, const hsadc_sample_config_t *config);

/*!
 * @brief Gets the default sample configuration.
 *
 * This function initializes each sample's configuration structure with an available settings.
 * The default values are:
 * @code
 *   config->channelNumber = 0U;
 *   config->channel6MuxNumber = 0U;
 *   config->channel7MuxNumber = 0U;
 *   config->enableDifferentialPair = false;
 *   config->zeroCrossingMode = kHSADC_ZeroCorssingDisabled;
 *   config->highLimitValue = 0x7FF8U;
 *   config->lowLimitValue = 0U;
 *   config->offsetValue = 0U;
 *   config->enableWaitSync = false;
 * @endcode
 * @param config Pointer to configuration structure. See the "hsadc_sample_config_t".
 */
void HSADC_GetDefaultSampleConfig(hsadc_sample_config_t *config);

/*!
 * @brief Enables the sample slot.
 *
 * This function enables the sample slot. Only the enabled sample slot can join the conversion sequence.
 *
 * @param base       HSADC peripheral base address.
 * @param sampleMask Mask value of sample slots in conversion sequence. Each bit corresponds to a sample slot.
 * @param enable     Enable or disable the feature.
 */
static inline void HSADC_EnableSample(HSADC_Type *base, uint16_t sampleMask, bool enable)
{
    if (enable)
    {
        base->SDIS &= ~HSADC_SDIS_DS(sampleMask);
    }
    else
    {
        base->SDIS |= HSADC_SDIS_DS(sampleMask);
    }
}

/*!
 * @brief Enables the interrupt for each sample slot when its result is ready.
 *
 * @param base       HSADC peripheral base address.
 * @param sampleMask Mask value of sample slots in conversion sequence. Each bit is corresponding to a sample slot.
 * @param enable     Enable or disable the feature.
 */
static inline void HSADC_EnableSampleResultReadyInterrupts(HSADC_Type *base, uint16_t sampleMask, bool enable)
{
    if (enable)
    {
        base->SCINTEN |= HSADC_SCINTEN_SCINTEN(sampleMask);
    }
    else
    {
        base->SCINTEN &= ~HSADC_SCINTEN_SCINTEN(sampleMask);
    }
}

/*!
 * @brief  Returns the sample ready flags of sample slots.
 *
 * @param  base HSADC peripheral base address.
 *
 * @return      Mask value for the sample slots if their result are ready.
 */
static inline uint16_t HSADC_GetSampleReadyStatusFlags(HSADC_Type *base)
{
    return (HSADC_RDY_RDY_MASK & base->RDY);
}

/*!
 * @brief  Gets the low-limit flags of sample slots.
 *
 * @param  base HSADC peripheral base address.
 *
 * @return      Mask value for the sample slots if their results exceed the low limit.
 */
static inline uint16_t HSADC_GetSampleLowLimitStatusFlags(HSADC_Type *base)
{
    return (HSADC_LOLIMSTAT_LLS_MASK & base->LOLIMSTAT);
}

/*!
 * @brief Clears low-limit flags of sample slots.
 *
 * @param base       HSADC peripheral base address.
 * @param sampleMask Mask value for the sample slots' flags to be cleared.
 */
static inline void HSADC_ClearSampleLowLimitStatusFlags(HSADC_Type *base, uint16_t sampleMask)
{
    base->LOLIMSTAT = HSADC_LOLIMSTAT_LLS(sampleMask);
}

/*!
 * @brief  Gets the high-limit flags of sample slots.
 *
 * @param  base HSADC peripheral base address.
 *
 * @return      Mask value for the sample slots if their results exceed the high limit.
 */
static inline uint16_t HSADC_GetSampleHighLimitStatusFlags(HSADC_Type *base)
{
    return (HSADC_HILIMSTAT_HLS_MASK & base->HILIMSTAT);
}

/*!
 * @brief Clears high-limit flags of sample slots.
 *
 * @param base       HSADC peripheral base address.
 * @param sampleMask Mask value for the sample slots to be cleared flags.
 */
static inline void HSADC_ClearSampleHighLimitStatusFlags(HSADC_Type *base, uint16_t sampleMask)
{
    base->HILIMSTAT = HSADC_HILIMSTAT_HLS(sampleMask);
}
/*!
 * @brief  Gets the zero crossing flags of sample slots.
 *
 * @param  base HSADC peripheral base address.
 *
 * @return      Mask value for the sample slots if their results cause the zero crossing event.
 */
static inline uint16_t HSADC_GetSampleZeroCrossingStatusFlags(HSADC_Type *base)
{
    return (HSADC_ZXSTAT_ZCS_MASK & base->ZXSTAT);
}

/*!
 * @brief Clears zero crossing flags of sample slots.
 *
 * @param base       HSADC peripheral base address.
 * @param sampleMask Mask value for the sample slots to be cleared flags.
 */
static inline void HSADC_ClearSampleZeroCrossingStatusFlags(HSADC_Type *base, uint16_t sampleMask)
{
    base->ZXSTAT = HSADC_ZXSTAT_ZCS(sampleMask);
}

/*!
 * @brief  Gets the sample result value.
 *
 * This function gets the sample result value. This returned value keeps its original formation just like in the
 * hardware result register. It includes the sign bit as the MSB and 3-bit left shifted value.
 *
 * @param  base        HSADC peripheral base address.
 * @param  sampleIndex Index of sample slot.
 *
 * @return             Sample's conversion value.
 */
static inline uint16_t HSADC_GetSampleResultValue(HSADC_Type *base, uint16_t sampleIndex)
{
    return base->RSLT[sampleIndex];
}

/* @} */

/*!
 * @name Calibration.
 * @{
 */

/*!
 * @brief Starts the hardware calibration.
 *
 * This function starts the single ended calibration and differential calibration for converter A and converter B
 * at the same time.
 * Note that this is a non blocking function. End of Scan flag and End of Calibration flag are both be set after the
 * calibration process. As a result, the user should check these two flags by using the function HSADC_GetStatusFlags()
 * to wait for the calibration process to complete.
 *
 * @param base                HSADC peripheral base address.
 * @param converterMask       Mask for converters to be operated. See the "_hsadc_converter_id".
 * @param calibrationModeMask Mask for calibration mode to be operated. See the "_hsadc_calibration_mode". Shouldn't be
 * zero.
 */
void HSADC_DoAutoCalibration(HSADC_Type *base, uint16_t converterMask, uint16_t calibrationModeMask);

/*!
 * @brief Gets the calibration result value.
 *
 * This function returns the single ended calibration value and differential calibration value for converter A and
 * converter B. The calibration value of each calibration mode for each converter can be received from this function's
 * return value by using the mask and shift definition from HSADC_CALIBRATION_VALUE_A_SINGLE_ENDED_MASK to
 * HSADC_CALIBRATION_VALUE_B_DIFFERENTIAL_SHIFT.
 *
 * @param base                HSADC peripheral base address.
 * @return                    Calibration value for converter A and converter B.
 */
uint32_t HSADC_GetCalibrationResultValue(HSADC_Type *base);

/*!
 * @brief Enables or disables the calibration result value.
 *
 * This function enables or disables converter A and converter B to use the calibration values to obtain the final
 * conversion result by calibration sum operation.
 *
 * @param base          HSADC peripheral base address.
 * @param converterMask Mask for converters to be operated. See the "_hsadc_converter_id".
 * @param enable        Enable or disable the feature.
 */
void HSADC_EnableCalibrationResultValue(HSADC_Type *base, uint16_t converterMask, bool enable);

/* @} */
#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* _FSL_HSADC_H_ */
